** Make a table of Jorge's measurements
+ JSON files read by [[file:luis-programas/arcs-summary-proplyds.py]]
+ Writes table to [[file:luis-programas/arcs-summary-proplyds.tab]]
+ Next, merge the two tables, giving priority to the Jorge measurements
#+BEGIN_SRC python :dir luis-programas :results output
  import numpy as np
  from  astropy.table import Table
  import json

  tab = Table.read("arcs-summary.tab", format="ascii.commented_header", delimiter="\t",
                     fill_values=('-', np.nan) )
  ptab = Table.read("arcs-summary-proplyds.tab", format="ascii.commented_header", delimiter="\t",
                     fill_values=('-', np.nan) )

  with open("../ll-data.json") as f:
      db = json.load(f)

  for source, data in db.items():
      if data["bname"] in ptab["Object"]:
          print("Updating", data["bname"], data["oname"])
          for colname in ptab.colnames[1:]:
              tab[colname][tab["Object"]==data["oname"]] = ptab[colname][ptab["Object"]==data["bname"]] 

  tab.write("arcs-summary-merge.tab", format="ascii.commented_header", delimiter="\t")

#+END_SRC

#+RESULTS:
: Updating LV2b 166-316
: Updating HST1 177-341
: Updating LV3 163-317
: Updating LV4 161-324
: Updating LV5 158-323
: Updating LV2 167-317

** Look at correlations
:PROPERTIES:
:dir:      luis-programas
:END:

#+name: annotations
#+BEGIN_SRC python
  famous = ['177-341', '167-317', '168-326', '161-324', '142-301']
  other_interesting = ['w073-227', 'w069-601', 'w266-558', 'w000-400', 'w005-514']

  def label_sources(labels, x, y, extramask=None, allmask=None):
      """Add labels at points (x, y) for selected sources"""
      mask = np.array(['LL' in source
                       or source in famous + other_interesting
                       for source in labels])
      if extramask is not None:
          mask = mask | extramask
      if allmask is not None:
          mask = mask & allmask
      radius = 5.0
      theta_max = np.pi/3.0
      for i, txt in enumerate(labels[mask]):
          theta = (2*np.random.random_sample() - 1.0)*theta_max
          dx, dy = radius*np.cos(theta), radius*np.sin(theta)
          ax.annotate(txt, (x[mask][i], y[mask][i]), (dx, dy),
                      textcoords='offset points', verticalalignment='center',
                      fontsize=5, alpha=0.6)
#+END_SRC

#+name: read-merge-table
#+BEGIN_SRC python
  tab = Table.read("arcs-summary-merge.tab", format="ascii.commented_header", delimiter="\t",
                   fill_values=('--', np.nan) )
#+END_SRC

#+name: read-luis-table
#+BEGIN_SRC python
  tab = Table.read("arcs-summary.tab", format="ascii.commented_header", delimiter="\t",
                   fill_values=('-', np.nan) )
#+END_SRC

#+name: mask-out-unwanted
#+BEGIN_SRC python
  with open("problem-sources.txt") as f:
      problem_sources = f.read().split('\n')
  with open("interproplyd.txt") as f:
      problem_sources += f.read().split('\n')

  m = np.isfinite(tab['R_out']) & np.isfinite(tab['R_in']) & (tab['R_out'] > tab['R_in'])
  m = m & np.array([not source in problem_sources for source in tab['Object']])
#+END_SRC

#+name: set-common-vars
#+BEGIN_SRC python
  A = tab['Rc_out']/tab['R_out']
  Ain = tab['Rc_in']/tab['R_in']
  H = (tab['R_out'] - tab['R_in'])/tab['R_out']
  D60 = tab['D']/60
  contrast = np.log10(tab['Dif_Bally']/tab['Value_bg_Bally'])
  q = tab['R_out']/tab['D']
  PA_star = (tab['PA_star'] - 180.0) % 360.0
  dPA = ((tab ['PA_out'] - tab ['PA_star'] + 180.0) % 360.0) - 180.0
#+END_SRC

#+BEGIN_SRC python :noweb yes :return figlist :results list :tangle luis-programas/will-correlations.py
  import numpy as np
  import matplotlib.pyplot as plt
  from  astropy.table import Table

  <<annotations>>
  <<read-merge-table>>
  <<mask-out-unwanted>>
  <<set-common-vars>>
   
  figlist = []

  pltfile = 'will-A-vs-q.pdf'
  fig = plt.figure(figsize=(7,6))
  ax = fig.add_subplot(111, axisbg="#eeeeee")
  plt.scatter(q[m], A[m], s=20*tab['R_out'][m], c=D60[m], vmin=0.0, cmap=plt.cm.hot, alpha=0.6)
  label_sources(tab['Object'], q, A, allmask=m)
  cb = plt.colorbar()
  cb.set_label('Projected distance from Trapezium, D / arcmin')
  plt.xlabel('Bowshock fractional size, q = r0/D')
  plt.ylabel('Bowshock bluntness, A = Rc/r0')
  ax.set_xscale('log')
  fig.savefig(pltfile)
  figlist.append('[[file:luis-programas/{0}][{0}]]'.format(pltfile))

  pltfile = 'will-H-vs-A.pdf'
  fig = plt.figure(figsize=(7,6))
  ax = fig.add_subplot(111, axisbg="#eeeeee")
  plt.scatter(A[m], H[m], s=20*tab['R_out'][m], c=D60[m], vmin=0.0, cmap=plt.cm.hot, alpha=0.6)
  label_sources(tab['Object'], A, H, (A > 5.0) | (A < 1.0) | (H <= 0.2) | (H >= 0.6), allmask=m)
  cb = plt.colorbar()
  cb.set_label('Projected distance from Trapezium, D / arcmin')
  plt.xlabel('Bowshock bluntness, A = Rc/r0')
  plt.ylabel('Shell relative thickness, H = h/r0')
  fig.savefig(pltfile)
  figlist.append('[[file:luis-programas/{0}][{0}]]'.format(pltfile))

  pltfile = 'will-H-vs-q.pdf'
  fig = plt.figure(figsize=(7,6))
  ax = fig.add_subplot(111, axisbg="#eeeeee")
  plt.scatter(q[m], H[m], s=20*tab['R_out'][m], c=np.log10(D60[m]), cmap=plt.cm.hot, alpha=0.6)
  label_sources(tab['Object'], q, H, allmask=m)
  cb = plt.colorbar()
  cb.set_label('Projected distance from Trapezium, D / arcmin')
  plt.xlabel('Bowshock fractional size, q = r0/D')
  plt.ylabel('Shell relative thickness, H = h/r0')
  ax.set_xscale('log')
  fig.savefig(pltfile)
  figlist.append('[[file:luis-programas/{0}][{0}]]'.format(pltfile))

  pltfile = 'will-q-vs-D.pdf'
  fig = plt.figure(figsize=(7,6))
  ax = fig.add_subplot(111, axisbg="#eeeeee")
  plt.scatter(D60[m], q[m], s=20*tab['R_out'][m], c=contrast[m], cmap=plt.cm.hot, alpha=0.6)
  label_sources(tab['Object'], D60, q, allmask=m)
  cb = plt.colorbar()
  cb.set_label('Shell/background brightness contrast')
  plt.xlabel('Projected distance from Trapezium, D / arcmin')
  plt.ylabel('Bowshock fractional size, q = r0/D')
  ax.set_xlim(0.05, 20.0)
  ax.set_xscale('log')
  ax.set_yscale('log')
  fig.savefig(pltfile)
  figlist.append('[[file:luis-programas/{0}][{0}]]'.format(pltfile))

  pltfile = 'will-r0-vs-D.pdf'
  fig = plt.figure(figsize=(7,6))
  ax = fig.add_subplot(111, axisbg="#eeeeee")
  plt.scatter(D60[m], tab['R_out'][m], s=100*H[m], c=contrast[m], cmap=plt.cm.hot, alpha=0.6)
  label_sources(tab['Object'], D60, tab['R_out'],
                (tab['R_out'] >= 5.0) | (tab['R_out'] <= 0.8), allmask=m)
  Darray = np.linspace(D60.min(), D60.max())
  r0norm = 0.8
  plt.plot(Darray, r0norm*Darray/Darray.min(), 'k--', zorder=-100)
  plt.plot(Darray, r0norm*(Darray/Darray.min ())**0.25, 'k-', zorder=-100)
  cb = plt.colorbar()
  cb.set_label('Brightness contrast, log10(Shell / BG)')
  plt.xlabel('Projected distance from Trapezium, D / arcmin')
  plt.ylabel('Bowshock radius, r0 / arcsec')
  plt.text(0.05, 0.05, 'Symbol size indicates shell relative thickness, H',
           transform=ax.transAxes, fontsize='x-small')
  ax.set_xlim(0.05, 20.0)
  ax.set_ylim(0.3, 11.0)
  ax.set_xscale('log')
  ax.set_yscale('log')
  fig.savefig(pltfile)
  figlist.append('[[file:luis-programas/{0}][{0}]]'.format(pltfile))

  pltfile = 'will-PA-vs-PA.pdf'
  fig = plt.figure(figsize=(7,6))
  ax = fig.add_subplot(111, axisbg="#eeeeee")
  plt.fill_betweenx([-90.0, 90.0], [0.0, 0.0], [90.0, 90.0], zorder=-10, alpha=0.05)
  plt.fill_betweenx([-90.0, 90.0], [180.0, 180.0], [270.0, 270.0], zorder=-10, alpha=0.05)
  plt.fill_betweenx([-90.0, 90.0], [360.0, 360.0], [450.0, 450.0], zorder=-10, alpha=0.05)
  plt.text(45.0, -80.0, 'NE\nquadrant',  ha='center', fontsize='x-small')
  plt.text(135.0, -80.0, 'SE\nquadrant', ha='center', fontsize='x-small')
  plt.text(225.0, -80.0, 'SW\nquadrant', ha='center', fontsize='x-small')
  plt.text(315.0, -80.0, 'NW\nquadrant', ha='center', fontsize='x-small')
  plt.axhline(zorder=-5)
  plt.scatter(PA_star[m], dPA[m], s=20*tab['R_out'][m], c=D60[m], cmap=plt.cm.hot, alpha=0.6)
  label_sources(tab['Object'], PA_star, dPA, np.abs(dPA) > 45.0, allmask=m)
  cb = plt.colorbar()
  cb.set_label('Projected distance from Trapezium, D / arcmin')
  plt.xlabel('PA of source from Trapezium, deg')
  plt.ylabel('Angle between bowshock axis and radial direction, deg')
  ax.set_xlim(-30.0, 375.0)
  ax.set_ylim(-90.0, 90.0)
  fig.savefig(pltfile)
  figlist.append('[[file:luis-programas/{0}][{0}]]'.format(pltfile))

#+END_SRC

#+RESULTS:
- [[file:luis-programas/will-A-vs-q.pdf][will-A-vs-q.pdf]]
- [[file:luis-programas/will-H-vs-A.pdf][will-H-vs-A.pdf]]
- [[file:luis-programas/will-H-vs-q.pdf][will-H-vs-q.pdf]]
- [[file:luis-programas/will-q-vs-D.pdf][will-q-vs-D.pdf]]
- [[file:luis-programas/will-r0-vs-D.pdf][will-r0-vs-D.pdf]]
- [[file:luis-programas/will-PA-vs-PA.pdf][will-PA-vs-PA.pdf]]


** Convert S(Ha) to shell density and pressure
:PROPERTIES:
:dir:      luis-programas
:END:
Based on Luis's program [[file:luis-programas/pressure.py]]
#+name: luis-constants
#+BEGIN_SRC python 
# Conversion counts/pixel -> erg/s/cm2/sr
Sfactor_ACS = 0.0025030687604156482

# Value of recombination coefficient in cm^3/s
alpha = 2.6e-13 

# Energy to 3 to 2... erg
Eha = 3.0267338723714944e-12 

# Relative extinction at Ha from Blagrave
fha = 0.78

# Distances 
D_orion_pc = 436.0
AU = 1.49597870691e13
cm_per_arcsec = D_orion_pc*AU

# Boltzmann in erg/K
k = 1.3806503e-16

# Temperatura
T = 1e4

# Stellar wind
yr = 3.15576e7
Msun = 1.989e33
km = 1.0e5
Mdot_wind = 3.5e-7*Msun/yr # g/s 
Vwind = 1200*km     # cm/s
#+END_SRC

#+name: arrow-utils
#+BEGIN_SRC python
  def draw_inclination_arrow(x0, y0, inc=45):
      """Show effects of inclination changes on x-axis"""
      x1 = x0/np.cos(np.radians(inc))
      plt.plot([x0, x1], [y0, y0], '-k')
      plt.plot(x0, y0, 'ok', ms=3.5)
      plt.plot(x1, y0, '>k', ms=3.5)
      plt.text(x1, y0, '   i = {}'.format(inc), va='center', fontsize='x-small')
#+END_SRC

#+RESULTS: arrow-utils
: None

Three categories: 
- -1 :: probably not a proplyd
- 0 :: looks like a proplyd
- 1 :: catalogued as a proplyd
#+name: identify-proplyds
#+BEGIN_SRC python
  with open("../ll-data.json") as f:
      db = json.load(f)
  
  is_proplyd = {}
  for data in db.values():
      if "LL" in data["bname"]:
          key = data["bname"]
      elif data["oname"]:
          key = data["oname"].split()[-1]
      else:
          continue
      if "proplyd?" in data["Notes"]:
          is_proplyd[key] = 0
      elif "proplyd" in data["Notes"]:
          is_proplyd[key] = 1
      else:
          is_proplyd[key] = -1
#+END_SRC

#+header: :tangle luis-programas/will-shell-physical.py
#+BEGIN_SRC python :noweb yes :return figlist :results list
  import numpy as np
  import matplotlib.pyplot as plt
  from  astropy.table import Table
  import json

  <<luis-constants>>
  <<annotations>>
  <<arrow-utils>>
  <<read-merge-table>>
  <<mask-out-unwanted>>
  <<set-common-vars>>
  <<identify-proplyds>>

  with open("extinction.json") as f:
      extinction_data = json.load(f)

  # Ha surface brightness, corrected for extinction
  Sha = Sfactor_ACS*tab['Dif_Bally']
  Chb = np.array([extinction_data.get(source, 0.0) for source in tab['Object']])
  Sha *= 10**(fha*Chb)

  # Thickness and radius of the shell for measurements of delta l
  h0 = tab['h']*cm_per_arcsec
  rc = tab['Rc_out']*cm_per_arcsec
  deltal = 2*np.sqrt(h0*rc)

  nshell = np.sqrt(4.*np.pi*Sha/(alpha*deltal*Eha))
  pshell = 2.0*nshell*k*T
  MdotV_in = pshell*4.*np.pi*(tab['R_in']*cm_per_arcsec)**2 *yr/Msun/km

  D60_grid = np.linspace(D60.min(), D60.max(), 2)
  Dcm_grid = 60*D60_grid*cm_per_arcsec
  Pram = Mdot_wind*Vwind/(4.*np.pi*Dcm_grid**2)

  proplyd_mask = np.array([is_proplyd[source] == 1 for source in tab['Object']])
  not_proplyd_mask = np.array([is_proplyd[source] == -1 for source in tab['Object']])
  maybe_proplyd_mask = np.array([is_proplyd[source] == 0 for source in tab['Object']])

  figlist = []

  pltfile = 'will-nshell-vs-D.pdf'
  fig = plt.figure(figsize=(7,6))
  ax = fig.add_subplot(111, axisbg="#eeeeee")
  plt.scatter(D60[m], nshell[m], s=10*deltal[m]/cm_per_arcsec, c=np.log10(Sha[m]), cmap=plt.cm.hot, alpha=0.6)
  label_sources(tab['Object'], D60, nshell, (nshell > 3500.0/D60) | (nshell < 1000.0/D60), allmask=m)
  cb = plt.colorbar()
  draw_inclination_arrow(0.1, 100*1.3**3, 30)
  draw_inclination_arrow(0.1, 100*1.3**2, 45)
  draw_inclination_arrow(0.1, 100*1.3, 60)
  draw_inclination_arrow(0.1, 100, 75)
  plt.text(0.1, 100/1.4, 'True distance correction', fontsize='x-small')
  cb.set_label('H alpha surface brightness, erg/s/cm2/sr')
  plt.xlabel('Projected distance from Trapezium, D / arcmin')
  plt.ylabel('Shell electron density, ne / pcc ')
  ax.set_xscale('log')
  ax.set_yscale('log')
  ax.set_xlim(0.05, 20.0)
  ax.set_ylim(50.0, 5.e4)
  fig.savefig(pltfile)
  figlist.append('[[file:luis-programas/{0}][{0}]]'.format(pltfile))

  pltfile = 'will-Pshell-vs-D.pdf'
  fig = plt.figure(figsize=(7,6))
  ax = fig.add_subplot(111, axisbg="#eeeeee")
  plt.scatter(D60[m], pshell[m], s=10*deltal[m]/cm_per_arcsec, c=np.log10(Sha[m]), cmap=plt.cm.hot, alpha=0.6)
  label_sources(tab['Object'], D60, pshell, allmask=m)
  cb = plt.colorbar()
  cb.set_label('H alpha surface brightness, erg/s/cm2/sr')
  plt.xlabel('Projected distance from Trapezium, D / arcmin')
  plt.ylabel('Shell pressure, P / dynes/cm^2 ')
  plt.plot(D60_grid, Pram, '-k')
  plt.plot(D60_grid*np.cos(np.radians(30)), Pram, '--k')
  plt.plot(D60_grid*np.cos(np.radians(60)), Pram, ':k')
  ax.set_xscale('log')
  ax.set_yscale('log')
  ax.set_xlim(0.05, 20.0)
  ax.set_ylim(2e-10, 1.5e-7)
  fig.savefig(pltfile)
  figlist.append('[[file:luis-programas/{0}][{0}]]'.format(pltfile))

  pltfile = 'will-MdotV-vs-D.pdf'
  fig = plt.figure(figsize=(7,6))
  ax = fig.add_subplot(111, axisbg="#eeeeee")
  mm = m & proplyd_mask
  plt.scatter(D60[mm], MdotV_in[mm], s=10*deltal[mm]/cm_per_arcsec, c='red', alpha=0.6)
  mm = m & maybe_proplyd_mask
  plt.scatter(D60[mm], MdotV_in[mm], s=10*deltal[mm]/cm_per_arcsec, c='orange', alpha=0.6)
  mm = m & not_proplyd_mask
  plt.scatter(D60[mm], MdotV_in[mm], s=10*deltal[mm]/cm_per_arcsec, c='black', alpha=0.6)
  label_sources(tab['Object'], D60, MdotV_in, not_proplyd_mask | (MdotV_in > 1.e-6/D60), allmask=m)
  plt.xlabel('Projected distance from Trapezium, D / arcmin')
  plt.ylabel('Inner flow Mdot V, Msun/yr km/s')
  ax.set_xscale('log')
  ax.set_yscale('log')
  ax.set_xlim(0.05, 20.0)
  ax.set_ylim(6e-9, 3e-5)
  fig.savefig(pltfile)
  figlist.append('[[file:luis-programas/{0}][{0}]]'.format(pltfile))


#+END_SRC

#+RESULTS:
- [[file:luis-programas/will-nshell-vs-D.pdf][will-nshell-vs-D.pdf]]
- [[file:luis-programas/will-Pshell-vs-D.pdf][will-Pshell-vs-D.pdf]]
- [[file:luis-programas/will-MdotV-vs-D.pdf][will-MdotV-vs-D.pdf]]

*** Other new detections
:LOGBOOK:
CLOCK: [2013-09-03 Tue 10:04]--[2013-09-03 Tue 13:45] =>  3:41
:END:
+ [X] 362-3137
  + in Bally field, just below the LL6 group
  + weak but totally believable
    + background 0.8
    + excess 0.05
  + not listed as a proplyd in Ricci
  + But in Da Rio 2009 as star
  + And #921 in Hillenbrand 1997
+ [X] 119-3155
  + In Bally field 14 and Robberto field 7L
  + To the south of 136-3057 in a region with many bowshocks and jets
  + 5:35:11.876 -5:31:55.40
  + Has a faint arc to the N and another one to the E, but the E one may be unrelated
+ [X] 203-3039 or MY Ori
  + 5:35:20.297 -5:30:39.37
  + In Bally field 14 and Robberto field 2L
  + Faint arc to N and jet pointing to E
  + The jet and bowshocks are described in Bally (2006) Fig 14 but they didn't seem to notice the stellar bowshock
+ [X] 109-246
  + Near to HH 202
  + Disk detected in [O III] absorption by BOM2000 (they give 109-247)
  + Has wonderful open outer bow shock
  + Complicated inner shock
  + Probable jet going to SSW
  + Star seems off-center wrt proplyd
+ [X] 106-245
  + Much smaller arc just behind 109-246
  + Both are immeresd in a shock that goes the other way
+ [X] 138-3024
  + 5:35:13.801 -5:30:24.34
  + This is a star in the wispy gray filaments to the S of LP Ori reflection nebula
  + The arc is  seen in blue continuum where it is just a hole really
  + But it is also seen in Ha, and looks more like a shell
+ [ ] There are many other stars like 138-3024 in the same zone that seem to have slightly dark regions around them
  + Each one is probably not significant, but maybe between them they could add up to something
+ [ ] LP Ori
+ [X] 065-502
  + 5:35:06.534 -5:25:01.53
  + Not listed as proplyd but clearly is one
  + Very weak but quite clear bowshock
  + In front of LL1
+ [X] 083-435
  + 5:35:08.289 -5:24:34.84
  + Another not listed as proplyd but maybe one
  + Similar to  065-502 but far far weaker - may not be real
  + Between  LL1 and giant shadow disk

    
*** TODO Looking for new proplyd bowshocks in the Ricci 2008 data
:LOGBOOK:
CLOCK: [2013-08-27 Tue 09:34]--[2013-08-27 Tue 10:04] =>  0:30
:END:
**** Map of the LL objects
:LOGBOOK:
- Note taken on [2013-08-17 Sat 18:51] \\
  Copied from [[id:A0F1F456-E918-4AB5-A97D-951E4BC82952][llobjects.org]]
:END:

#+BEGIN_SRC python :results output
  import sys
  print sys.path
  
#+END_SRC

#+RESULTS:
: ['', '/Users/will/Library/Enthought/Canopy_64bit/User/lib/python2.7/site-packages/pip-1.3.1-py2.7.egg', '/Users/will/Library/Enthought/Canopy_64bit/User/lib/python2.7/site-packages/scikit_image-0.9dev-py2.7-macosx-10.6-x86_64.egg', '/Users/will/Library/Enthought/Canopy_64bit/User/lib/python2.7/site-packages/pyregion-1.1.1-py2.7-macosx-10.6-x86_64.egg', '/Users/will/Source/src/odelab', '/Users/will/Library/Enthought/Canopy_64bit/User/lib/python2.7/site-packages/adsbibdesk-3.1.1-py2.7.egg', '/Users/will/Library/Enthought/Canopy_64bit/User/lib/python2.7/site-packages/Astropysics-0.1.dev_r1180-py2.7.egg', '/Users/will/Library/Enthought/Canopy_64bit/User/lib/python2.7/site-packages/astroquery-0.2.dev1248-py2.7.egg', '/Users/will/Library/Enthought/Canopy_64bit/User/lib/python2.7/site-packages/astropy-0.3.dev5708-py2.7-macosx-10.6-x86_64.egg', '/Users/will/Library/Enthought/Canopy_64bit/User/lib/python2.7/site-packages/APLpy-0.9.10.dev574-py2.7.egg', '/Users/will/Library/Enthought/Canopy_64bit/User/lib/python2.7/site-packages/pywcsgrid2-1.0.dev151-py2.7.egg', '/Applications/Canopy.app/appdata/canopy-1.0.0.1160.macosx-x86_64/Canopy.app/Contents/lib/python27.zip', '/Applications/Canopy.app/appdata/canopy-1.0.0.1160.macosx-x86_64/Canopy.app/Contents/lib/python2.7', '/Applications/Canopy.app/appdata/canopy-1.0.0.1160.macosx-x86_64/Canopy.app/Contents/lib/python2.7/plat-darwin', '/Applications/Canopy.app/appdata/canopy-1.0.0.1160.macosx-x86_64/Canopy.app/Contents/lib/python2.7/plat-mac', '/Applications/Canopy.app/appdata/canopy-1.0.0.1160.macosx-x86_64/Canopy.app/Contents/lib/python2.7/plat-mac/lib-scriptpackages', '/Applications/Canopy.app/appdata/canopy-1.0.0.1160.macosx-x86_64/Canopy.app/Contents/lib/python2.7/lib-tk', '/Applications/Canopy.app/appdata/canopy-1.0.0.1160.macosx-x86_64/Canopy.app/Contents/lib/python2.7/lib-old', '/Applications/Canopy.app/appdata/canopy-1.0.0.1160.macosx-x86_64/Canopy.app/Contents/lib/python2.7/lib-dynload', '/Users/will/Library/Enthought/Canopy_64bit/User/lib/python2.7/site-packages', '/Users/will/Library/Enthought/Canopy_64bit/User/lib/python2.7/site-packages/PIL', '/Users/will/Library/Enthought/Canopy_64bit/System/lib/python2.7/site-packages', '/Users/will/Library/Enthought/Canopy_64bit/System/lib/python2.7/site-packages/PIL', '/Applications/Canopy.app/appdata/canopy-1.0.0.1160.macosx-x86_64/Canopy.app/Contents/lib/python2.7/site-packages']
: 
#+BEGIN_SRC sh
which python
#+END_SRC

#+RESULTS:
: /Users/will/Library/Enthought/Canopy_64bit/User/bin/python

#+header: :var table=orion-ll-objects :var ptable=ricci-proplyd-table
#+BEGIN_SRC python :results output
  import astropysics
  from astropysics import coords
  import numpy as np
  import matplotlib.pyplot as plt
  import json
  import os
  
  def find(name, path):
      """
      Original from http://stackoverflow.com/questions/1724693/find-a-file-in-python
      """
      for root, dirs, files in os.walk(path):
          if name in files:
              return os.path.join(root, name)
      return None
              
  
  names, RAs, Decs, Fields = list(), list(), list(), list()
  for bname, oname, sname, RA, Dec, Ref, Bally, Notes, Arc in table:
      names.append(bname or oname or sname)
      RAs.append(RA)
      Decs.append(Dec)
      Fields.append(Bally)
  
  [x0], [y0] = coords.radec_str_to_decimal(["05:35:16.463"], ["-05:23:23.18"])
  x, y = coords.radec_str_to_decimal(RAs, Decs) 
  x = -(x - x0)*3600.0
  y = (y - y0)*3600.0
  plt.plot(x, y, "o", alpha=0.2)
  for label, xx, yy, field_list in zip(names, x, y, Fields):
      plt.annotate(label, (xx, yy), alpha=0.8, size=5,
                   xytext=(-2,2), textcoords='offset points', ha='right', va='bottom',)
      #
      # Try and draw the inner and outer arcs
      #
  
      # First, work out where the JSON file is...
      try:
          field = "{:02d}".format(field_list)
      except:
          try:
              field = field_list[:2]
          except:
              print "failed"
              continue
  
      # folder = "j8oc{}010_drz".format(field)
      jsonfile = "{}-xy.json".format(label.split()[-1])
      jsoncfile = "{}-xyc.json".format(label.split()[-1])
      found = find(jsoncfile, "..")
      if found is not None:
          f = open(found)
      else:
          found = find(jsonfile, "..")
          if found is not None:
              f = open(found)
          else:
              print "Could not open ", jsonfile
              continue
      # try:
      #     f = open(jsoncfile)
      # except IOError:
      #     try: 
      #         f = open(jsonfile)
      #     except IOError:
      #         print "Could not open ", jsonfile
      #         continue
  
      # Second, load in the data and draw the arcs
      arc_data = json.load(f)
      for arc, color in ["inner", "m"], ["outer", "g"]:
          if arc in arc_data:
              dx = np.array(arc_data[arc]["x"])
              dy = np.array(arc_data[arc]["y"])
              plt.plot(xx - dx, yy + dy, "-" + color, lw=1.0, alpha=0.6)
              print "Plotted {} arc for {}".format(arc, found)
              # Now try and draw arrows for the arc axes too
              R0 = arc_data[arc]["R0"]
              PA = np.radians(arc_data[arc]["PA0"])
              ax = -R0*np.sin(PA)
              ay = R0*np.cos(PA)
              plt.arrow(xx, yy, 4*ax, 4*ay, fc='none', ec=color, 
                        width=0.0003, alpha=0.6, lw=0.5,
                        head_width=2.0, head_length=4.0,
              )
              if "Rc" in arc_data[arc]:
                  xc = arc_data[arc]["xc"]
                  yc = arc_data[arc]["yc"]
                  Rc = arc_data[arc]["Rc"]
                  PAc = np.radians(arc_data[arc]["PAc"])
                  # Plot the fitted circle if present
                  plt.plot(xx - xc, yy + yc, "+k", ms=2.0)
                  c = plt.Circle((xx - xc, yy + yc), radius=Rc, fc='none', ec="k", alpha=0.2, lw=0.2)
                  plt.gca().add_patch(c)
                  ax = -0.5*Rc*np.sin(PAc)
                  ay = 0.5*Rc*np.cos(PAc)
                  plt.arrow(xx-xc, yy+yc, 4*ax, 4*ay, fc='none', ec=color, 
                            width=0.0003, alpha=0.3, lw=0.3,
                            head_width=2.0, head_length=4.0,
                        )
  
  pColor_from_Type = {
      "i": "r", "d": "k", "rn": "c", "j": "g",
  }
  pSize_from_Type = {
      "i": 1.0, "d": 2.0, "rn": 0.7, "j": 0.7,
  }
  pRAs, pDecs, pColors, pSizes = list(), list(), list(), list()
  for name, RA, Dec, OW, Type, Note in ptable[2:]:
      pRAs.append(RA.replace(" ", ":"))
      pDecs.append(Dec.replace(" ", ":"))
      pColors.append(pColor_from_Type[Type])
      pSizes.append(pSize_from_Type[Type])
  x, y = coords.radec_str_to_decimal(pRAs, pDecs)
  pSizes = np.array(pSizes)*15.0
  x = -(x - x0)*3600.0
  y = (y - y0)*3600.0
  plt.scatter(x, y, c=pColors, s=pSizes, faceted=False, alpha=0.5, zorder=100)
  
  plt.axis("equal")
  plt.xlim(-400, 600)
  plt.ylim(-700, 200)
  plt.xlabel("RA offset, arcsec")
  plt.ylabel("Dec offset, arcsec")
  plt.title("Positions of LL objects in the Orion Nebula")
  plt.grid()
  plt.gcf().set_size_inches( (20, 20) )
  figname = "ll-positions.pdf"
  plt.savefig(figname)
  #return figname
  # return x.min(), x.max(), y.min(), y.max()
#+END_SRC

#+RESULTS:
#+begin_example
Plotted inner arc for ../LuisLL/j8oc18010_drz/LL2-xyc.json
Plotted outer arc for ../LuisLL/j8oc18010_drz/LL2-xyc.json
Plotted inner arc for ../LuisLL/j8oc17010_drz/LL3-xyc.json
Plotted outer arc for ../LuisLL/j8oc17010_drz/LL3-xyc.json
Plotted inner arc for ../LuisLL/j8oc24010_drz/LL4-xyc.json
Plotted outer arc for ../LuisLL/j8oc24010_drz/LL4-xyc.json
Plotted inner arc for ../LuisLL/j8oc17010_drz/4468-605-xyc.json
Plotted outer arc for ../LuisLL/j8oc17010_drz/4468-605-xyc.json
Plotted inner arc for ../LuisLL/j8oc09010_drz/4578-251-xyc.json
Plotted outer arc for ../LuisLL/j8oc09010_drz/4578-251-xyc.json
Plotted inner arc for ../LuisLL/j8oc16010_drz/4582-635-xyc.json
Plotted outer arc for ../LuisLL/j8oc16010_drz/4582-635-xyc.json
Plotted inner arc for ../LuisLL/j8oc09010_drz/w000-400-xyc.json
Plotted outer arc for ../LuisLL/j8oc09010_drz/w000-400-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/w005-514-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/w005-514-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/w012-407-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/w012-407-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/w014-414-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/w014-414-xyc.json
Plotted inner arc for ../LuisLL/j8oc16010_drz/022-635-xyc.json
Plotted outer arc for ../LuisLL/j8oc16010_drz/022-635-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/w030-524-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/w030-524-xyc.json
Plotted inner arc for ../LuisLL/j8oc16010_drz/041-637-xyc.json
Plotted outer arc for ../LuisLL/j8oc16010_drz/041-637-xyc.json
Plotted inner arc for ../LuisLL/j8oc16010_drz/042-628-xyc.json
Plotted outer arc for ../LuisLL/j8oc16010_drz/042-628-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/w044-527-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/w044-527-xyc.json
Plotted inner arc for ../LuisLL/j8oc09010_drz/049-143-xyc.json
Plotted outer arc for ../LuisLL/j8oc09010_drz/049-143-xyc.json
Plotted inner arc for ../LuisLL/j8oc09010_drz/051-024-xyc.json
Plotted outer arc for ../LuisLL/j8oc09010_drz/051-024-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/LL1-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/LL1-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/065-502-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/065-502-xyc.json
Plotted outer arc for ../LuisLL/j8oc14010_drz/066-3251-xy.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/w069-601-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/w069-601-xyc.json
Plotted inner arc for ../LuisLL/j8oc09010_drz/072-134-xyc.json
Plotted outer arc for ../LuisLL/j8oc09010_drz/072-134-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/w073-227-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/w073-227-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/083-435-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/083-435-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/101-233-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/101-233-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/102-157-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/102-157-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/106-245-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/106-245-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/109-246-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/109-246-xyc.json
Plotted inner arc for ../LuisLL/j8oc14010_drz/116-3101-xyc.json
Plotted outer arc for ../LuisLL/j8oc14010_drz/116-3101-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/117-421-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/117-421-xyc.json
Plotted inner arc for ../LuisLL/j8oc14010_drz/119-3155-xyc.json
Plotted outer arc for ../LuisLL/j8oc14010_drz/119-3155-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/121-434-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/121-434-xyc.json
Plotted inner arc for ../LuisLL/j8oc02010_drz/131-046-xyc.json
Plotted outer arc for ../LuisLL/j8oc02010_drz/131-046-xyc.json
Plotted inner arc for ../LuisLL/j8oc02010_drz/132-053-xyc.json
Plotted outer arc for ../LuisLL/j8oc02010_drz/132-053-xyc.json
Plotted inner arc for ../LuisLL/j8oc14010_drz/136-3057-xyc.json
Plotted outer arc for ../LuisLL/j8oc14010_drz/136-3057-xyc.json
Plotted inner arc for ../LuisLL/j8oc14010_drz/138-3024-xyc.json
Plotted outer arc for ../LuisLL/j8oc14010_drz/138-3024-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/142-301-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/142-301-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/154-225-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/154-225-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/154-240-xy.json
Plotted inner arc for ../Jorge_prop/LV5/LV5-xyc.json
Plotted outer arc for ../Jorge_prop/LV5/LV5-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/159-221-xy.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/159-326-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/159-326-xyc.json
Plotted inner arc for ../Jorge_prop/LV4/LV4-xyc.json
Plotted outer arc for ../Jorge_prop/LV4/LV4-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/163-222-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/163-222-xyc.json
Plotted inner arc for ../Jorge_prop/LV3/LV3-xyc.json
Plotted outer arc for ../Jorge_prop/LV3/LV3-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/165-235-xy.json
Plotted inner arc for ../Jorge_prop/LV2b/LV2b-xyc.json
Plotted outer arc for ../Jorge_prop/LV2b/LV2b-xyc.json
Plotted inner arc for ../Jorge_prop/LV2/LV2-xyc.json
Plotted outer arc for ../Jorge_prop/LV2/LV2-xyc.json
Could not open  LV1-xy.json
Could not open  168-326N-xy.json
Could not open  168-328-xy.json
Plotted inner arc for ../Jorge_prop/169-338/169-338-xyc.json
Plotted outer arc for ../Jorge_prop/169-338/169-338-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/170-249-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/170-249-xyc.json
Could not open  173-236-xy.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/175-321-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/175-321-xyc.json
Plotted inner arc for ../Jorge_prop/HST1/HST1-xyc.json
Plotted outer arc for ../Jorge_prop/HST1/HST1-xyc.json
Could not open  173-342-xy.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/178-258-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/178-258-xyc.json
Plotted inner arc for ../Jorge_prop/180-331/180-331-xyc.json
Plotted outer arc for ../Jorge_prop/180-331/180-331-xyc.json
Plotted inner arc for ../LuisLL/j8oc01010_drz/189-329-xyc.json
Plotted outer arc for ../LuisLL/j8oc01010_drz/189-329-xyc.json
Plotted inner arc for ../LuisLL/j8oc14010_drz/203-3039-xyc.json
Plotted outer arc for ../LuisLL/j8oc14010_drz/203-3039-xyc.json
Could not open  205-230-xy.json
Plotted inner arc for ../LuisLL/j8oc02010_drz/206-043-xyc.json
Plotted outer arc for ../LuisLL/j8oc02010_drz/206-043-xyc.json
Could not open  212-400-xy.json
Plotted inner arc for ../LuisLL/j8oc07010_drz/261-3018-xyc.json
Plotted outer arc for ../LuisLL/j8oc07010_drz/261-3018-xyc.json
Could not open  w266-558-xy.json
Plotted inner arc for ../LuisLL/j8oc07010_drz/305-811-xyc.json
Plotted outer arc for ../LuisLL/j8oc07010_drz/305-811-xyc.json
Plotted inner arc for ../LuisLL/j8oc08010_drz/308-3036-xyc.json
Plotted outer arc for ../LuisLL/j8oc08010_drz/308-3036-xyc.json
Plotted inner arc for ../LuisLL/j8oc07010_drz/LL5-xyc.json
Plotted outer arc for ../LuisLL/j8oc07010_drz/LL5-xyc.json
Plotted inner arc for ../LuisLL/j8oc08010_drz/LL6-xyc.json
Plotted outer arc for ../LuisLL/j8oc08010_drz/LL6-xyc.json
Plotted inner arc for ../LuisLL/j8oc08010_drz/344-3020-xyc.json
Plotted outer arc for ../LuisLL/j8oc08010_drz/344-3020-xyc.json
Could not open  LL7-xy.json
Plotted inner arc for ../LuisLL/j8oc08010_drz/362-3137-xyc.json
Plotted outer arc for ../LuisLL/j8oc08010_drz/362-3137-xyc.json
#+end_example


**** Write tables to JSON files
:LOGBOOK:
CLOCK: [2013-11-14 Thu 16:34]--[2013-11-14 Thu 17:34] =>  1:00
:END:
+ This is to minimise the amount of work that is done inside the org-mode file
+ Write both JSON and TOML versions of the files
  + [[https://github.com/mojombo/toml][TOML spec]]
  + [[https://github.com/uiri/toml/blob/master/toml.py][TOML python parser/writer]]
    + [ ] The writer needs improving
      + blank lines between dicts
      + indentation 

*** New design
:LOGBOOK:
CLOCK: [2013-11-16 Sat 11:10]--[2013-11-16 Sat 11:47] =>  0:37
CLOCK: [2013-11-15 Fri 11:58]--[2013-11-15 Fri 13:47] =>  1:49
:END:
1. [X] =find-xy-shell.py SOURCE= 
   + Reads arcs from =SOURCE-forma.reg=
   + Writes data to =SOURCE-arcdata.json=
2. [X] =fit-circle-shell.py SOURCE=
   + Reads arc data from =SOURCE-arcdata.json=
   + Fits circles to inner and outer arcs
   + Saves plot: =SOURCE-arcfits.pdf=
   + Saves DS9 region file: =SOURCE-arcfits.reg=
   + Writes fit data to =SOURCE-arcdata.json=
3. [X] =extract-image.py SOURCE --fitsfile PATH/IMAGE.fits=
   + Run separately for each IMAGE
   + Reads arc data from =SOURCE-arcdata.json=
   + Reads large image data from =IMAGE.fits=
   + Reads instrument configuration from  =IMAGE.fits=
   + Writes small image around source to =SOURCE-IMAGE-extract.fits=
   + Writes data about instrument configuration and image files to =SOURCE-arcdata.json=
4. [X] =arc_brightness.py SOURCE=
   + Reads arc data and instrument data from =SOURCE-arcdata.json=
   + For each =IMAGE= found:
     + Reads image data from =SOURCE-IMAGE-extract.fits=
     + Calculates brightness in shell and background regions
     + Writes data about shell brightness to =SOURCE-arcdata.json=
     + Saves plots: =SOURCE-IMAGE-arcbright-th.png= and =SOURCE-IMAGE-arcbright-z.png=
5. [X] =plot-image.py SOURCE --image IMAGE= 
   + Reads arc data from =SOURCE-arcdata.json=
   + Reads image data from =SOURCE-IMAGE-extract.fits=
   + Saves image plot: =SOURCE-IMAGE-images.pdf=
   + Writes data about plot limits to =SOURCE-arcdata.json=
     
** TODO Determinando la forma de los arcos
:LOGBOOK:
CLOCK: [2013-09-19 Thu 19:27]--[2013-10-07 Mon 09:47] => 422:20
:END:

*** Comparing source positions
:LOGBOOK:
CLOCK: [2013-11-14 Thu 11:12]--[2013-11-14 Thu 13:45] =>  2:33
- Note taken on [2013-11-14 Thu 11:11] \\
  Actually, it does work well enough.  Accuracy of 2 or 3 pixels
- Note taken on [2013-11-14 Thu 09:49] \\
  No, this does not work so well - go back to doing this by hand
:END:
+ [[file:~/Work/Bowshocks/Jorge/bowshock-shape/read-shapes-LL/find-bally-offsets.py][Script]] to calculate the offsets
+ [[file:~/Work/Bowshocks/Jorge/bowshock-shape/read-shapes-LL/plot-bally-offsets.py][Another script]] to plot the offsets
+ There is quite a lot of dispersion in the offsets
  + Both within a field and between fields
  + Some fields appear to share a common median offset:
    + 01, 16, 14, (17, 06, 24?) all have [-1.0, 0.5] (or more or less)
  + But others are inconsistent:
    + 07, 08 are around [-2.0, 0.0] (but with large scatter)
    + 09 is around [-0.8, -0.2] (compact)
    + 02 is around [0.0, 0.0] (also compact)
    + 18 is in a world of its own at [0.5, 1.0], but there is only 1 source
*** Aligning images by hand
:LOGBOOK:
CLOCK: [2013-11-14 Thu 09:50]--[2013-11-14 Thu 11:11] =>  1:21
CLOCK: [2013-09-05 Thu 12:34]--[2013-09-06 Fri 08:53] => 20:19
:END:
+ Hopefully a simple shift will suffice
#+name: bally-corrections 
| Original           |      x |      y |        RA |        Dec | Fix |
| j8oc01010_drz.fits | 2074.0 | 2010.0 | 83.777118 | -5.4114893 |   1 |

#+BEGIN_SRC python :var table=bally-corrections :dir ~/Work/OrionTreasury/Bally-ACS :results output
import astropy.io.fits as pyfits
for infile, x, y, ra, dec, dofix in table[1:]:
    if int(dofix) == 1:
        hdu = pyfits.open(infile)["SCI"]
        hdu.header.update(crpix1=float(x), crpix2=float(y), crval1=float(ra), crval2=float(dec))
        outfile = infile.replace("_drz", "_robwcs")
        hdu.writeto(outfile, clobber=True)
#+END_SRC

#+RESULTS:

*** An LL object in Carina
     CLOCK: [2012-02-27 Mon 21:51]--[2012-02-27 Mon 22:01] =>  0:10

+ \cite{Smith:2010} find a object in the Carina Nebula (HH 1012) that looks identical to the LL objects.  See their Fig 14.
+ There is also the object HHc-9 (see their Fig 24), which they say is a jet bowshock, but it looks to me like it might be a LL bow too.  However, there is no central star to be seen, which is rather odd. 


#+BEGIN_SRC bibtex
  
  @article{Smith:2010,
    Abstract =     {We report the discovery of new Herbig-Haro (HH) jets
                    in the Carina Nebula, and we discuss the
                    protostellar outflow activity of a young OB
                    association. These are the first results of an
                    Halpha imaging survey of Carina conducted with the
                    Hubble Space Telescope (HST)/Advanced Camera for
                    Surveys. Adding to the one previously known example
                    (HH 666), we detect 21 new HH jets, plus 17 new
                    candidate jets, ranging in length from 0.005 to
                    3pc. Using the Halpha emission measure to estimate
                    jet densities, we derive jet mass-loss rates ranging
                    from 8 × 10-9 to ~10-6Msolaryr-1, but a comparison
                    to the distribution of jet mass-loss rates in Orion
                    suggests that we may be missing a large fraction of
                    the jets below 10-8Msolaryr-1. A key qualitative
                    result is that even some of the smallest dark
                    globules with sizes of <~1 arcsec (0.01pc) are
                    active sites of ongoing star formation because we
                    see HH jets emerging from them, and that these offer
                    potential analogues to the cradle of our Solar
                    system because of their proximity to dozens of
                    imminent supernovae that will enrich them with
                    radioactive nuclides like 60Fe. Although most
                    proplyd candidates identified from ground-based data
                    are dark cometary globules, HST images now reveal
                    proplyd structures in the core of the Tr 14 cluster,
                    only 0.1-0.2 pc from several extreme O-type
                    stars. Throughout Carina, some HH jets have axes
                    bent away from nearby massive stars, while others
                    show no bend, and still others are bent toward the
                    massive stars. These jet morphologies serve as `wind
                    socks' strong photoevaporative flows can shape the
                    jets, competing with the direct winds and radiation
                    from massive stars. We find no clear tendency for
                    jets to be aligned perpendicular to the axes of dust
                    pillars. Finally, even allowing for a large number
                    of jets that may escape detection, we find that HH
                    jets are negligible to the global turbulence of the
                    surrounding region, which is driven by massive star
                    feedback.  Based on observations made with the
                    NASA/ESA Hubble Space Telescope, obtained at the
                    Space Telescope Science Institute, which is operated
                    by the Association of Universities for Research in
                    Astronomy, Inc., under NASA contract NAS5-26555.
                    E-mail: nathans@astro.berkeley.edu},
    Adsnote =      {Provided by the SAO/NASA Astrophysics Data System},
    Adsurl =       {http://adsabs.harvard.edu/abs/2010MNRAS.405.1153S},
    Archiveprefix ={arXiv},
    Author =       {{Smith}, N. and {Bally}, J. and {Walborn}, N.~R.},
    Date-Added =   {2012-02-28 03:16:39 +0000},
    Date-Modified ={2012-02-28 03:16:39 +0000},
    Doi =          {10.1111/j.1365-2966.2010.16520.x},
    Eprint =       {1002.4898},
    Journal =      {\mnras},
    Keywords =     {stars: formation, stars: pre-main-sequence, ISM:
                    Herbig-Haro objects, ISM: individual: NGC 3372, ISM:
                    individual: NGC 3324, ISM: jets and outflows},
    Month =        jun,
    Pages =        {1153-1186},
    Primaryclass = {astro-ph.SR},
    Title =        {{HST/ACS H{$\alpha$} imaging of the Carina Nebula:
                    outflow activity traced by irradiated Herbig-Haro
                    Jets}},
    Volume =       405,
    Year =         2010,
    Bdsk-Url-1 =   {http://dx.doi.org/10.1111/j.1365-2966.2010.16520.x}
  }
  
#+END_SRC

*** A new LL object: LL 261-3018!
      CLOCK: [2012-02-27 Mon 20:45]--[2012-02-27 Mon 21:00] =>  0:15
+ I just found a new object while looking at the Bally 2006 paper!
  + It is along the southern side of the HH 502 jet
    + Same RA as knot S6 (boxes 18, 19): 05 35 26.1
    + Nearly same Dec as knot S5 (box 17): say -05 30 18

+ I thought I had found another one too, but it is already catalogued as 308-3036, just to W of LL6

** Surface brightness measurements
:LOGBOOK:
CLOCK: [2013-11-20 Wed 13:26]--[2013-11-20 Wed 13:43] =>  0:17
:END:

*** Data on the relevant filters
:LOGBOOK:
CLOCK: [2013-11-20 Wed 17:33]--[2013-11-20 Wed 18:00] =>  0:27
CLOCK: [2013-11-20 Wed 17:28]--[2013-11-20 Wed 17:33] =>  0:05
:END:
Useful places I have discussed this before
+ [[id:C1210509-AE95-4F02-8556-1BF7B670B2E9][llobjects.org]] has callibration constants from OD and discussion
  + it seems that [N II] and continuum contribution to H\alpha are small
  + whereas H\alpha contribution to [N II] is more

**** Working out which WFPC2 image applies to each source
:LOGBOOK:
CLOCK: [2013-11-20 Wed 21:32]--[2013-11-20 Wed 23:56] =>  2:24
:END:
+ Use montage's =mCoverageCheck= ([[http://montage.ipac.caltech.edu/docs/mCoverageCheck.html][docs]])
+ Opened github [[https://github.com/deprecated/bowshock-shape/issues/26][issue #26]] on this
+ Can't get python version to work - try command line version:
***** FIrst get tables of each type of image file
#+BEGIN_SRC sh :results verbatim
  for instrument in wfpc2 acs nicmos; do
      mImgTbl ~/Work/OrionTreasury/${instrument} montage-images-${instrument}.tbl
  done
  mImgTbl ~/Work/OrionTreasury/Bally-ACS montage-images-bally.tbl
#+END_SRC

#+RESULTS:
: [struct stat="OK", count=117, badfits=0, badwcs=0]
: [struct stat="OK", count=76, badfits=37, badwcs=75]
: [struct stat="OK", count=204, badfits=0, badwcs=0]
: [struct stat="OK", count=116, badfits=0, badwcs=41]

***** Then try to find all the images that cover 177-341
#+BEGIN_SRC sh :results verbatim
  for instrument in wfpc2 acs nicmos bally; do
      mCoverageCheck foo bar montage-images-${instrument}.tbl coverage-${instrument}-177-341.tbl \
          -point 83.82362812499996 -5.394682638888889 
      grep fits coverage-${instrument}-177-341.tbl |cut -c 269-
  done
#+END_SRC

#+RESULTS:
#+begin_example
[struct stat="OK", count="2"]

wfpc2/hlsp_orion_hst_wfpc2_38_f656n_v1_sci.fits 
wfpc2/hlsp_orion_hst_wfpc2_39_f656n_v1_sci.fits 
[struct stat="OK", count="22"]

acs/hlsp_orion_hst_acs_strip0l_f435w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip0l_f435w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip0l_f555w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip0l_f555w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip0l_f658n_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip0l_f658n_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip0l_f775w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip0l_f775w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip0l_f850lp_v1_drz.fits 
acs/hlsp_orion_hst_acs_strip0l_f850lp_v1_drz.fits 
acs/hlsp_orion_hst_acs_strip5l_f435w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip5l_f435w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip5l_f555w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip5l_f555w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip5l_f658n_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip5l_f658n_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip5l_f775w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip5l_f775w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip5l_f850lp_v1_drz.fits 
acs/hlsp_orion_hst_acs_strip5l_f850lp_v1_drz.fits 
acs/hlsp_orion_hst_acs_strip5r_f658n_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip5r_f658n_v1_drz.fits  
[struct stat="OK", count="4"]

nicmos/hlsp_orion_hst_nicmos_4a_f110w_v1_drz.fits 
nicmos/hlsp_orion_hst_nicmos_4a_f160w_v1_drz.fits 
nicmos/hlsp_orion_hst_nicmos_4c_f110w_v1_drz.fits 
nicmos/hlsp_orion_hst_nicmos_4c_f160w_v1_drz.fits 
[struct stat="OK", count="8"]

Bally-ACS/j8oc01010_drc.fits                 
Bally-ACS/j8oc01010_drz.fits                 
Bally-ACS/j8oc01010_drz.fits                 
Bally-ACS/j8oc01010_drz.fits                 
Bally-ACS/j8oc01010_robwcs.fits              
Bally-ACS/j8oc01010_wcs.fits                 
Bally-ACS/j8oc01010_wcs.fits                 
Bally-ACS/j8oc01010_wcs.fits                 
#+end_example

***** Then try to find all the images that cover LL7
+ Position is 5:35:35.129  -5:33:49.12
#+BEGIN_SRC python
  import astropy.coordinates as coords
  import astropy.units as u
  c = coords.ICRSCoordinates("5:35:35.129  -5:33:49.12", unit=(u.hour, u.deg))
  return c
#+END_SRC

#+RESULTS:
: <ICRSCoordinates RA=83.89637 deg, Dec=-5.56364 deg>

#+BEGIN_SRC sh :results verbatim
  for instrument in wfpc2 acs nicmos bally; do
      mCoverageCheck foo bar montage-images-${instrument}.tbl coverage-${instrument}-LL7.tbl \
          -point 83.89637 -5.56364
      grep fits coverage-${instrument}-LL7.tbl |cut -c 269-
  done
#+END_SRC

#+RESULTS:
#+begin_example
[struct stat="OK", count="2"]

wfpc2/hlsp_orion_hst_wfpc2_1b_f656n_v1_sci.fits 
wfpc2/hlsp_orion_hst_wfpc2_64_f656n_v1_sci.fits 
[struct stat="OK", count="24"]

acs/hlsp_orion_hst_acs_strip2l_f435w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip2l_f435w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip2l_f555w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip2l_f555w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip2l_f658n_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip2l_f658n_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip2l_f775w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip2l_f775w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip2l_f850lp_v1_drz.fits 
acs/hlsp_orion_hst_acs_strip2l_f850lp_v1_drz.fits 
acs/hlsp_orion_hst_acs_strip7l_f435w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip7l_f435w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip7l_f555w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip7l_f555w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip7l_f658n_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip7l_f658n_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip7l_f775w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip7l_f775w_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip7l_f850lp_v1_drz.fits 
acs/hlsp_orion_hst_acs_strip7l_f850lp_v1_drz.fits 
acs/hlsp_orion_hst_acs_strip8l_f658n_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip8l_f658n_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip8r_f658n_v1_drz.fits  
acs/hlsp_orion_hst_acs_strip8r_f658n_v1_drz.fits  
[struct stat="OK", count="2"]

nicmos/hlsp_orion_hst_nicmos_0d_f110w_v1_drz.fits 
nicmos/hlsp_orion_hst_nicmos_0d_f160w_v1_drz.fits 
[struct stat="OK", count="0"]

#+end_example


** LL 1 Proper Motions
:PROPERTIES:
:dir:      LL1-proper-motions
:END: 

We need to apply the =-delay= argument before each frame 
#+BEGIN_SRC sh :results silent
ORDER="\
 LL1_1995-03-21_O3-Ha-N2_WFPC2.png \
 LL1_2004-01-14_Ha_ACS.png \
 LL1_2005-04-07_B-V-I_ACS.png \
 LL1_2012-01-07_O3-N2-S2_WFC3.png \
 LL1_2012-01-07_Hb-O3-Ha_WFC3.png"

convert $(for a in "$ORDER"; do printf -- "-delay 25 %s " $a; done; ) HH888-motions.gif
#+END_SRC

Check that the delay came out right (measured in 1/100 sec)
#+BEGIN_SRC sh 
identify -format "%T, " HH888-motions.gif
#+END_SRC
#+RESULTS:
| 25 | 25 | 25 | 25 | 25 |

Display in browser
#+BEGIN_SRC sh :results silent
open -a Safari HH888-motions.gif
#+END_SRC

